---
type: LocationCurve
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# LocationCurve

`Autodesk.Revit.DB.LocationCurve` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Curve | — | `public Curve Curve { get ; set ; }` |
| Property | ElementsAtJoin | — | `public ElementArray this [ int end ] { get ; set ; }` |
| Property | JoinType | — | `public JoinType this [ int end ] { get ; set ; }` |